{
    "type": "database",
    "name": "nvkz_species_database",
    "objects": [
        {
            "type": "table",
            "database": null,
            "name": "Species",
            "withoutRowId": false,
            "strict": false,
            "ddl": "CREATE TABLE Species (id NUMERIC PRIMARY KEY UNIQUE NOT NULL, name TEXT, image BLOB, habitat TEXT, type TEXT)",
            "columns": [
                {
                    "name": "id",
                    "type": "NUMERIC",
                    "constraints": [
                        {
                            "type": "PRIMARY KEY",
                            "definition": "PRIMARY KEY "
                        },
                        {
                            "type": "UNIQUE",
                            "definition": "UNIQUE "
                        },
                        {
                            "type": "NOT NULL",
                            "definition": "NOT NULL"
                        }
                    ]
                },
                {
                    "name": "name",
                    "type": "TEXT"
                },
                {
                    "name": "image",
                    "type": "BLOB"
                },
                {
                    "name": "habitat",
                    "type": "TEXT"
                },
                {
                    "name": "type",
                    "type": "TEXT"
                }
            ],
            "rows": [
                [
                    1,
                    "Полынь",
                    "Распространена по всему Северному полушарию. В России встречается почти повсеместно",
                    "Растение"
                ],
                [
                    2,
                    "Ель",
                    "Распространена на северо-востоке Европейской части России, по всей Сибири и далее, до побережья Охотского моря и среднего Амура.",
                    "Растение"
                ],
                [
                    3,
                    "Борщевик",
                    "В России борщевик встречается в Центральном и Северно-Западном регионах, Подмосковье, Поволжье и Южном Федеральном округе.",
                    "Растение"
                ],
                [
                    4,
                    "Синица",
                    "Распространена на территории всей Евразии и Северо-Западной Африки.",
                    "Животное"
                ],
                [
                    5,
                    "Кедр",
                    "Распространён в Сибири, Восточном Урале, Восточном Казахстане, Монголии и Северном Китае.",
                    "Растение"
                ],
                [
                    8,
                    "Пихта",
                    "Распространены в Европе, Азии, Северной Америке.",
                    "Растение"
                ],
                [
                    7,
                    "Лиса",
                    "Встречаются в России, Северной Америке, крайний Север Африки.",
                    "Животное"
                ],
                [
                    6,
                    "Подорожник",
                    "Распространён по всей России, кроме Дальнего Севера.",
                    "Растение"
                ],
                [
                    22,
                    "Соболь",
                    "Ареал соболя охватывает почти всю таёжную зону Евразии от северного Предуралья до тихоокеанского побережья и прилежащих островов.",
                    "Животное"
                ],
                [
                    21,
                    "Таволга",
                    "Ареал растения таволги охватывает значительную часть умеренного и субарктического пояса Северного полушария.",
                    "Растение"
                ],
                [
                    20,
                    "Тополь",
                    "Тополя произрастают в умеренных регионах северного полушария.",
                    "Растение"
                ],
                [
                    19,
                    "Белка",
                    "Естественный ареал белки обыкновенной простирается от Атлантического побережья Европы до Тихоокеанского побережья Азии, охватывая лесную и лесостепную зоны Евразии.",
                    "Животное"
                ],
                [
                    18,
                    "Кровохлебка",
                    "Кровохлёбка лекарственная произрастает в основном в северных и средних широтах.",
                    "Растение"
                ],
                [
                    17,
                    "Клен",
                    "Клёны широко распространены в Северном полушарии, от полярных областей Европы и Северной Америки до тропических районов Центральной Америки и Южной Азии.",
                    "Растение"
                ],
                [
                    16,
                    "Бурундук",
                    "Ареал бурундука обширен и охватывает всю таёжную зону Евразийского материка от северных областей Европы до Тихоокеанского побережья Азии.",
                    "Животное"
                ],
                [
                    15,
                    "Клевер",
                    "Ареал клевера включает умеренную и субтропическую зоны Евразии и Северной Америки, а также горы Средней и Южной Америки, тропическую и субтропическую Африку.",
                    "Растение"
                ],
                [
                    14,
                    "Липа",
                    "Распространена в умеренной и субтропической зонах Северного полушария.",
                    "Растение"
                ],
                [
                    13,
                    "Дятел",
                    "Распространён по всей Европе и России, кроме Ирландии, северных регионов Скандинавии и заполярной России.",
                    "Животное"
                ],
                [
                    12,
                    "Бодяк",
                    "На территории России распространён повсеместно, исключая северные регионы.",
                    "Растение"
                ],
                [
                    11,
                    "Дуб",
                    "Распространён в регионах Северного Полушария с умеренным, субтропическим и тропическим климатом.",
                    "Растение"
                ],
                [
                    10,
                    "Соловей",
                    "Ареал обитания охватывает Восточную Европу и Россию.",
                    "Животное"
                ],
                [
                    23,
                    "Осина",
                    "Ареал осины включает Европу, Северную Африку, Кавказ, Западную и Восточную Сибирь, Дальний Восток России, Центральную Азию, Китай и Монголию.",
                    "Растение"
                ],
                [
                    9,
                    "Черемуха",
                    "Встречается повсюду в мире в зоне умеренного климата.",
                    "Растение"
                ],
                [
                    24,
                    "Калина",
                    "Естественный ареал калины обыкновенной охватывает территорию Европы, Кавказа, Малой и Средней Азии, Сибири, Северной Африки. ",
                    "Растение"
                ],
                [
                    25,
                    "Бурый медведь",
                    "Ареал бурого медведя охватывает всю лесную и лесотундровую зоны Евразии и Северной Америки.",
                    "Животное"
                ],
                [
                    26,
                    "Береза",
                    "Берёза широко распространена в Северном полушарии, её ареал простирается от субтропиков до тундры.",
                    "Растение"
                ],
                [
                    27,
                    "Мать-и-мачеха",
                    "Мать-и-мачеха обыкновенная широко распространена в Евразии.",
                    "Растение"
                ],
                [
                    28,
                    "Лось",
                    "Ареал лося распространяется в лесной зоне Северного полушария, реже в лесотундре, лесостепи и на окраинах степной зоны. ",
                    "Животное"
                ],
                [
                    29,
                    "Сосна",
                    "Сосна распространена в умеренной зоне и горных субтропических областях Евразии и Северной Америки.",
                    "Растение"
                ],
                [
                    30,
                    "Бобр",
                    "Ареал обитания бобров в основном ограничен Евразией.",
                    "Животное"
                ]
            ]
        }
    ]
}